---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeVertexArray.Item(System.Int32)
source: html/1ad21401-acd6-a49b-f0f4-006e01aa813f.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual SlabShapeVertex this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.